---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSystem.Ways
source: html/d19637f9-60cf-e684-c968-3eb25f635bb9.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSystem.Ways Property

The circuit ways used in the Electrical System.

## Syntax (C#)
```csharp
public int Ways { get; }
```

## Remarks
This property is used to retrieve the ways of the Electrical System on a panel.